'''
Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.
'''

number_n = int(input('Введите число N: '))
i = 0
print(f'Степени двойки до числа {number_n} :')
while (2 ** i <= number_n):
  print(f'2^{i} = {2 ** i}')
  i += 1